[
{"name": "Aai Caretaker", "last_updated": "2020", "address": "Room No. B/4, Ashok Nagar, Near Krishna Medical Store, Chembur, Mumbai 400074. Maharashtra ", "mobile": "+91 22 25530537", "email": "info@aaicaretaker.org.in", "website": "www.aaicaretaker.in", "annual_expenditure": "138,990,084", "description": "Aai Caretaker is involved in diverse activities such as as Saaf Angan (spreading awareness for clean environment), Self Help Groups (SHGs for development activities), tree plantation, and medical camps.  At present, its focus is to provide computer education to deserving underprivileged children. In collaboration with a local computer training institute, Yash Computer Education, Aai Caretaker has initiated a programme to provide Certificate Course In Information Technology (CCIT) and Hardworking and Networking course to about 20-30 children at subsidised fees. The objective is to make the underprivileged computer literate.  Aai Caretaker is registered with the NGO Partnership System, a government initiative. It is also registered with Central Social Welfare Board. In 2012, Aai Caretaker received a letter of appreciation from the Minister of State Excise and Non-Conventional Energy for their work. "},
{"name": "Aarambh Trust", "last_updated": "2017", "address": "33-B, Gitanjali, Sector 17, Vashi, Mumbai 400703. Maharashtra ", "mobile": "+91 22 27680965", "email": "info@aarambh.org", "website": "www.aarambh.org", "annual_expenditure": "19,531,147", "description": "Aarambh Trust works through Community Service Centers, providing educational, health and vocational skills to underprivileged children, women and youth. Aarambh was founded in 1996 in Maharashtra with the mission to catalyze social and economic change in marginalized communities with a focus on the rights of underprivileged children and empowerment of women.  They currently operate 6 urban and 4 rural centers, serving approximately 4,000 beneficiaries.  Aarambh reaches out to the following groups:   The children being supported by Aarambh's programs come from underprivileged migrant backgrounds, and are typically on the verge of dropping out from their schools. Aarambh provides these children with support classes in subjects like Math, English, Science, and Computers. The children also receive a daily mid-day meal.  The women beneficiaries receive training in tailoring via a course approved by Singer, the sewing machine company. The Aarambh certificate is highly regarded in the community, with many of the women being placed at nearby garment manufacturing mills, or taking private orders from home, thus being able to supplement the family income.  The youth in the community are trained in spoken English, and provided with computer based training programmes such as Tally, MS-CIT, etc. Aarambh has tie-ups with corporates to place these students in good quality jobs.  Aarambh has also undertaken following new initiatives:  School Adoption: Aarambh has adopted the Samata Hindi Vidyalaya at Turbhe which caters to the children of the poorest migrants in the area. Aarambh raised funds for the renovation of the school. E-learning Program: Audio-visual teaching aids are provided to municipal schools, for students of standards 1 to 8 in the Marathi and English mediums.  Over the next few years, Aarambh plans to provide educational and health support for 5,000 children, skill development for 1,000 youth, as well as working with 1,000 women to help them access and exercise their rights to health, social & economic prosperity. "},
{"name": "Abhinav", "last_updated": "2015", "address": "Vishnu Vihar (Opp.Surandra Nagar), Jansath Road, Muzaffarnagar 251001. Uttar Pradesh ", "mobile": "+91 8057901700", "email": "info@abhinavindia.org", "website": "www.abhinavindia.org", "annual_expenditure": "9,493,108", "description": "Abhinav provides help to the urban and rural poor in the areas of sanitation and skill development for vocational activities.  Key activities in 2014-15:   A comprehensive design method for tropical conditions and communal usage is being encouraged by the Government under ILCS. The key elements under ILCS model propagated by Abhinav are component sharing, i.e. the user community is responsible for financing, implementing, and managing the internal components of the low-cost sanitation system (household latrines, lane sewers, and secondary sewer systems), while the local government is responsible for financing, implementing and managing the external components (trunk sewers, treatment and disposal works).  The organization has been running Abhinav Resources In Skill Enhancement (ARISE) Training Centre, through which rural people are being made independent. The Centre provided training to 705 beneficiaries as beauticians, in sewing and embroidery, and computer operations. In FY15, 358 beneficiaries received training, of which 18 opened their own beautician business, 8 opened their own computer centre, and 18 started their own sewing and embroidery work.  Abhinav started this centre at Muzaffarnagar to help rural residents become independent. Earlier the organization provided training in making pickles, sauces, noodles, jam, jelly, and vinegar, but it now also provides training for grinding of spices, bakery products, canned products, etc. In FY15, Abhinav trained 223 people and inspired 14 people to become entrepreneurs.  Under this campaign, the organization provides clean drinking water in rural and urban areas and encourages building toilets. Abhinav helped build toilets in the homes of families Below Poverty Line (BPL). During FY15, Abhinav built 61 toilets in various villages of Uttar Pradesh and also distributed 400 toilet cleaning kits.     Abhinav has adopted a Government school “Primary School Titawi 1” in district Muzaffarnagar. It provided the school with better facilities like installation of biometric machine for attendance, training facilities in different creative activities, developed school infrastructure, and provided students with educational facilities like school bags, stationery, and uniforms. "}
]