[
{"Name": "Mission Oxygen", "Description": "Mission Oxygen began as a overnight initiative by a community of founders and entrepreneurs across Delhi/NCR to aid and assist hospitals that were running out of oxygen to treat Covid19 patients. Different members across this community segregated tasks according to their core competencies across crowdfunding, supply procurement, logistics, distribution/demand estimation, amplification and PR with the aim of purchasing, importing and delivering life saving concentrators to hospitals and nursing homes across the city.", "State": "Delhi NCR", "Contact": "https://www.ketto.org/fundraiser/mission-oxygen-helping-hospitals-to-save-lives\n  https://www.missionoxygen.org/", "Email": null},
{"Name": "Gautam Gambhir Foundation", "Description": "The Gautam Gambhir Foundation is extending their support to the marginalized, by assuring that their health care workers stand at the first line of defense.", "State": "Delhi NCR", "Contact": "https://gautamgambhirfoundation.org/donate/\n  https://gautamgambhirfoundation.org", "Email": "info@gautamgambhirfoundation.org"},
{"Name": "Mazdoor Kitchen ", "Description": "Mazdoor Kitchen is a citizen run voluntary initiative, working to provide meals and subsistence to daily wage workers in North Delhi. Run by a dedicated team of volunteers comprising professors, students, artists and people from the community itself, it has been providing meals and ration kits to hundreds of people across North Delhi. ", "State": "Delhi (North)", "Contact": "https://www.ketto.org/fundraiser/mazdoorkitchen\n  https://www.instagram.com/mazdoorkitchen/", "Email": null},
{"Name": "Breathe India", "Description": "A group of IIT alumni, in coordination with SaveLife foundation have started a fund collection drive for oxygen .concentrators to be setup in and around Delhi NCR region.", "State": "Delhi NCR", "Contact": "https://milaap.org/fundraisers/support-arrange-oxygen-concentrators-in-delhi\n  https://milaap.org/fundraisers/support-arrange-oxygen-concentrators-in-delhihttps://milaap.org/fundraisers/support-arrange-oxygen-concentrators-in-delhi", "Email": "ashu95.ranka@gmail.com"},
{"Name": "Chikka Foundation", "Description": "Chikka Federation is a United Nations accredited NGO that is carrying out Covid-19 relief work through distribution of ration, masks and soaps amongst the resourceless commmunities of Muzaffarpur and providing meals to some daily wage workers and domestic help who have been rendered jobless in the current situation. The NGO is also carrying out awareness campaigns about the importance of maintaining social distance.", "State": "Delhi, Bihar", "Contact": "http://www.chikkafederation.org/", "Email": ": Santosh Kumar "},
{"Name": "Access Foundation", "Description": "Access Foundation a  registered NGO u/s 12AA and 80G of Income tax act, has been working since the beginning of Pandemic  to provide free ambulance services with the fleet of 6 ambulances we presently have . More than 350 patients have benefitted using our free cylinders and concentrators services. Access is also a part of 2 isolation centres at Golconda and Malakpet which will be run free of cost. Ration has been distributed to about 3500  afflicted families during the past one year . Also Access Foundation plays a vital role in the HUM helpline where about 4000 patients have obtained free online consultations by experts. Livelihood projects have been in full swing to help the people re establish themselves. \n\t\t\tAmbulance helpline (free for Govt hospitals , isolation centres, vaccine centres ) : 9908820066 \n\t\t\tHUM helpline for free consultations : 7306600600", "State": "Hyderabad", "Contact": " https://accessfoundation.in/donation", "Email": null},
{"Name": "Enrich Lives Foundation", "Description": "Enrich Lives Foundation (formerly Annapurna Movement) is a non-profit organization focused on hunger alleviation, education, women empowerment, poverty alleviation and public health. Founded during the COVID-19 2020 lockdown in India by individuals with past involvement in social causes as Annapurna Movement, the organization was involved in the distribution of food grains and meals to the people worst affected. Enrich Lives Foundation is now involved in a variety of causes affecting the most underprivileged sections of the society:  1) Meal distribution 2) Grocery kit distribution 3) Job placements", "State": "Mumbai", "Contact": "https://www.ketto.org/fundraiser/supporting-the-needy-through-COVID-19-crisis\n  https://www.annapurnamovement.com/home", "Email": "team@enrichlivesfoundation.org"},
{"Name": "Khaana Chahiye", "Description": "Khaana Chahiye Foundation started as a citizen-led campaign in March 2020 to meet the immediate, lockdown-induced food demands of the homeless, migrant workers, daily wage laborers, and other vulnerable populations in the city of Mumbai", "State": "Mumbai", "Contact": "https://fundraisers.giveindia.org/fundraisers/khaanachahiye-mumbai-is-battling-hunger-along-with-covid-19-again\n  https://www.khaanachahiye.com", "Email": "contact@khaanachahiye.com"},
{"Name": "Swasth", "Description": "Founded in 2009, Swasth Foundation is a non-profit social enterprise committed to health and joy for all. They focus on improving the well-being of the poor by providing a range of affordable and high-quality primary-preventive health services.", "State": "Mumbai", "Contact": "https://www.swasth.org/donate.html\n  https://www.swasth.org/index.html", "Email": "info@swasth.org"},
{"Name": "United Way Mumbai", "Description": "United Way Mumbai is a premier non-profit organization with a mission to improve lives by mobilizing the caring power of communities to advance the common good. As a leader in the Indian development sector, UWM works closely with a network of 400+ NGOs and a large number of corporates for their CSR programmes, workplace giving campaigns and other events. This includes designing of CSR policy and strategies, due diligence of NGO partners, programme implementation, employee volunteering, impact assessments and ­financial and programmatic reporting.", "State": "Mumbai", "Contact": "https://www.unitedwaymumbai.org/donation.htm\n  https://www.unitedwaymumbai.org/", "Email": "contact@unitedwaymumbai.org"},
{"Name": "Spoorthi Foundation- Coronavarus Relief Fund", "Description": "Sphoorti creates a safe and secure haven for our children to learn, improve, and bloom into who they really are so they can grow up to afford themselves the dignity and strength they need to break free of the cycle. As an organization, we work to erase the barriers between the kids and their potential. This campaign can help provide basic nutrition and vitamin and mineral tablets, dry fruits along with sanitary products like masks, gloves and sanitizers.", "State": "Telangana", "Contact": "https://pages.razorpay.com/pl_EcmuS3Uv5CxrfX/view\n  https://www.sphoorti.org", "Email": "srivyal@sphoorti.org"},
{"Name": "Hemkunt Foundation", "Description": "Gurugram based NGO working on 12+ projects from last 12 years for upliftment of underprivileged section of society. They are currently distributing Oxygen Cylinders to COVID-19 patients for free.", "State": "Delhi NCR/Haryana", "Contact": " https://www.donatekart.com/Hemkunt-Foundation/Give-Oxygen-Cylinders?utm_source=facebook&utm_medium=cpc&utm_campaign=2834_hemkunt\n  https://hemkuntfoundation.com/contact/", "Email": "hemkuntfoundation13@gmail.com"},
{"Name": "Sakina Foundation", "Description": "‘Sakina’ – Peace for one and all – Sakina Foundation strives for this very humane yearning. Since last year they are involved in covid relief measures majorly in Telangana and different parts of India. They are accepting donation in the form of oxygen cylinders, Remdesivir injections, covid medicines, masks, sanitizers, gloves, PPE, grocery. ", "State": "Telangana, AP", "Contact": "http://sakinafoundation.org/", "Email": "9885178688"},
{"Name": "ACT Grants", "Description": "ACT grant is backing India’s best social entrepreneurs to combat COVID-19 using inventive start-up thinking. they are using their resources to find solutions to the acute shortage of oxygen by setting up oxygen concentrators at hospitals and nursing homes.", "State": "Mumbai, Bengaluru", "Contact": "https://actgrants.in/donate/\n  https://actgrants.in/", "Email": "core-pm@actgrants.in"},
{"Name": "Feeding from Far", "Description": "Feeding From Far is an initiative that has been feeding the poor and unemployed who are struggling to feed themselves during the lockdown. They have managed to distributed over 10 lakh meals to the needy since the first lockdown hit through cooked meals and ration kits.", "State": "Mumbai, Govandi", "Contact": "https://www.ketto.org/fundraiser/FeedingfromfarForCorona\n  https://www.facebook.com/feedingfromfar/", "Email": "feedingfromfar@gmail.com"},
{"Name": "Tarai Environment Awareness Samiti (TEAS)", "Description": "Farmers, Villagers, Community etc. for their development, livelihood, health and education. TEAS along with the Government Organization, delivering various activities helping Government in implementing the Government policies to the grass root level.", "State": "Uttar Pradesh, Maharashtra", "Contact": "https://teasngo.org/", "Email": "ngoteasblp@gmail.com"},
{"Name": "Khalsa Aid", "Description": "Khalsa Aid international is providing free oxygen concentrators to COVID patients. ", "State": "Delhi, Punjab, Chandigarh", "Contact": "https://www.khalsaaid.org/donate-india\n  https://www.khalsaaid.org/", "Email": "foodbank@khalsaaid.org"},
{"Name": "MCKS Food", "Description": "MCKS Food for the Hungry Foundation Delhi, is a not for profit organization started in 2005. Infused with Master Choa Kok Sui's teachings, the foundation looks to be the force bringing about the change in and around us. They affect the lives of people in a tangible way; reaching out with food to the hungry and empowering them with skills to move from despair to hope.", "State": "Delhi, Jharkhand, Orissa", "Contact": "https://mcksfood.com/donate\n  https://mcksfood.com/", "Email": "info@mcksfood.com"},
{"Name": "Making the Difference", "Description": "Making the Difference (MTD) is working to improve the quality of life for disadvantaged individuals through nutrition, health care, education. They are providing medical equipments all over Mumbai, masks and kits PPE in Varanasi, tiffin service to home quarantine patient in Mira bhayander, ration distribution for local communities all over Mumbai. ", "State": "Mumbai, Varanasi & Mira Bhayander", "Contact": "https://pages.razorpay.com/pl_H1F8zUWh1CWF8p/view\n  https://makingthedifference.in/", "Email": "help@mtdngo.org"},
{"Name": "Khushiyaan Foundation", "Description": "Khushiyaan Foundation is extending its on-ground support by feeding people through their \"Roti-Ghar\" initiative.", "State": "Delhi, Bengaluru, Hyderabad, Orissa", "Contact": "https://donate.khushiyaanfoundation.org/donate\n  https://www.khushiyaanfoundation.org/", "Email": "support@khushiyaanfoundation.org"},
{"Name": "Give India", "Description": "Established in 2000, Give India is one of the most trusted crowdfunding websites in India. They have launched ICRF-2 to support gaps in healthcare and other critical needs.  ", "State": "Delhi, Bengaluru, Mumbai, Patna", "Contact": "https://covid.giveindia.org/\n  https://covid.giveindia.org/", "Email": "ruchi@giveindia.org"},
{"Name": "Help Now - Ambulance Services", "Description": "HelpNow was started by 3 IITians Aditya Makkar, Shikar Agarwal and Venkatesh Amrutwar and has built the largest network of private ambulance.  HelpNow is an Initiative by young students providing a safe, 24x7 logistics network for transporting COVID patients/suspects, Drugs, Phlebotomists, Healthcare workers (docs, nurses) and Blood/Organs/Medical supplies in India.                                                                           You can help by donating funds for :  1) Purchasing BLS Oxygen Ambulances. 2) 50,000+ PPE Kits. The staff of 300 ambulances (drivers and paramedics), require a minimum of 5 kits a day, per person. 3) Extending free ambulance support to the poor. 4) Incentivizing an army of drivers to join the cause and reinvigorate ambulance supply.", "State": "Mumbai, Delhi, Bengaluru, Pune", "Contact": "https://www.ketto.org/fundraiser/getHelpNow\n  https://www.gethelpnow.in/#/", "Email": null},
{"Name": "Concern India", "Description": "Concern India Foundation was set up in 1991 as a registered non-profit, public charitable trust to extend financial and non-financial support to grassroots level NGOs working in the areas of education, health and community development.", "State": "Mumbai, New Delhi, Bengaluru, Chennai, Kolkata, Hyderabad", "Contact": "https://www.concernindiafoundation.org/donate/\n  https://www.concernindiafoundation.org/", "Email": "bangalore@concernindia.org // gaver.chatterjee@concernindia.org"},
{"Name": "KVN Foundation", "Description": "KVN Foundation is supplying free oxygen concentrators to the needy so that they can get critical life support till they find a hospital bed, get access to doctors, or recover completely. These will be provided for 5 to 10 days’ duration as needed, will then be taken back, sanitized, reused on next patient with fresh set of consumables.", "State": "Bangalore, Chennai, Hyderabad, Mumbai, and Noida.", "Contact": "https://fundraisers.giveindia.org/nonprofits/kvn-foundation\n  https://kvnfoundation.com/", "Email": null},
{"Name": "Milaap", "Description": "Milaap is one of India's most used crowdfunding platform. Multiple non-profits are raising funds on this platform for various relief causes related to COVID 19.", "State": "Delhi NCR, Hyderabad, Chennai, Bihar, Bengaluru", "Contact": "https://milaap.org/fundraisers/support-covid-19-delhi-2021-affected-people\n  https://milaap.org/fundraisers/donate-to-coronavirus-relief-fund \n  https://milaap.org/fundraisers/support-india \n  https://milaap.org/fundraisers/support-hlfppt-1\n  https://milaap.org/fundraisers/support-mercy-mission\n  https://milaap.org/fundraisers/support-grameenfoundation\n  https://milaap.org/", "Email": "feedback@milaap.org"},
{"Name": "Uttishtha Foundation", "Description": "Uttishtha Foundation is working on the following initiatives: 1) Family Survival Kits which include basic ration . Along with Corona protective gear like masks, bathing and washing soaps, for disadvantaged elders and their family of 5. 2) Protective Hygiene Kits for our elders, to fight COVID-19 which include Sanitizers, Mask, Tissues, Hand wash etc. 3) Free Meals to the homeless in night shelters, on roads, elders in old age homes, slums and migrant daily wage labors who have nowhere and no one to turn to.  \n\t\t\tWe were able to help more than 60 families across the nation.   Currently, they are looking for donations to procure Oxygen Concentrators and install them at rural clinics that are in dire need of Oxygen and other basic healthcare amenities.", "State": "Sitapur, Delhi NCR, Lucknow, Villages across UP", "Contact": "https://uttishthafoundation.com/donations/covid-19-help/\n  https://uttishthafoundation.com/about-us/", "Email": "uttishthafoundation@gmail.com"},
{"Name": "Goonj Rahat COVID", "Description": "Goonj aims to build an equitable relationship of strength, sustenance and dignity between the cities and villages using the under-utilized urban material as a tool to trigger development with dignity, across the country.", "State": "Bengaluru, Chennai, Delhi, Hyderabad, Kochi, Kolkata, Mumbai, Rishikesh", "Contact": "https://goonj.org/donate/\n  https://goonj.org/support-covid-19-affected/", "Email": null},
{"Name": "Pint Network", "Description": "PINT - Plasma In Need for Transfusion , a non-profit organization and online platform helping COVID-19 patients in need of convalescent plasma find and match with donors, quicker and more efficiently.", "State": "Mumbai, Delhi, TN, Gujarat, UP, WB, Rajasthan, Karnataka, Andhra Pradesh, Haryana, MP", "Contact": "https://www.ketto.org/fundraiser/help-as-many-COVID-19-patients-in-need\n  https://pintnetwork.com/home", "Email": "admin@pintnetwork.com  "},
{"Name": "Uday Foundation", "Description": "The Uday Foundation is a non-profit organization based in New Delhi, India.  disaster relief. It is starting a campaign #StayWell to make and distribute at least 10,000 Wellness Kits – comprising some basic over the counter medicines, a tetra-pack of healthy drink such as ORS, oximeter, etc.", "State": "Delhi NCR, Jammu and Kashmir, Uttarakhand, Uttar Pradesh, Andhra Pradesh and Orissa", "Contact": "https://www.udayfoundation.org/donatefood/\n  https://www.udayfoundation.org/", "Email": "info@udayfoundation.org"},
{"Name": "Plan India", "Description": "Plan India has reached out to 200,000+ families with dry ration and hygiene kits, meeting the urgent needs of 1 million+ people on the ground in 12 states. To ensure learning does not stop for girls’ during the pandemic, Plan India is distributing 35000+ education kits. Each kit contains textbooks and reference books as per the girls’ grade, notebooks, pen and pencil.", "State": "Siddharth Nagar (Uttar Pradesh), Haridwar (Uttarakhand), Hazaribagh, West Singhbhum, and Khunti (Jharkhand), Karauli (Rajasthan), and Muzaffarpur (Bihar).", "Contact": "https://www.planindia.org/get-involved/make-a-donation/covid-19-crisis/", "Email": "planindia@planindia.org"},
{"Name": "SEEDS (Sustainable Environment and Ecological Development Society)", "Description": "SEEDS is a leading humanitarian organization recently awarded with the most prestigious annual Subhash Chandra Bose Aapda Prabandhan Puraskar 2021 by the Government of India for its invaluable contribution and selfless service rendered in the field of Disaster Management. It is currently working towards the continuing challenge of Covid-19. Sharing the increased burden on our health care system, SEEDS is supporting through:", "State": "Delhi, Haryana, Uttarakhand, Bihar, West Bengal, Kerala, Karnataka, Maharashtra, Telangana, Punjab, Uttar Pradesh", "Contact": "https://www.seedsindia.org/donation/?donation_for=covid19\n  https://www.seedsindia.org/banktransfers/\n  https://www.seedsindia.org/covid19/", "Email": "Sidarth Sharma"},
{"Name": "Akshaya patra Foundation", "Description": "The Akshaya Patra Foundation is an NGO in India headquartered in Bengaluru. Our organization strives to eliminate classroom hunger by implementing the Mid-Day Meal Scheme in the government schools and government-aided schools. Alongside, Akshaya Patra also aims at countering malnutrition and supporting the right to education of socio-economically disadvantaged children. Since 2000, Akshaya Patra has been concerting all its efforts towards providing fresh and nutritious meals to children on every single school day. We are continuously leveraging technology to multiply our reach. The state-of-the-art kitchens have become a subject of study and have attracted curious visitors from around the world. Partnership with the Government of India and various State Governments, along with the persistent support from corporates, individual donors, and well-wishers have helped them to grow from serving just 1,500 children in 5 schools in 2000 to serving 1.8 million children. Today, Akshaya Patra is the world’s largest (not-for-profit run) Mid-Day Meal Programme serving wholesome food every school day to over 1.8 million children from 19,039 schools across 12 states & 2 Union territories of India.", "State": "Andhra Pradesh, Assam, Chhattisgarh, Delhi, Gujarat, Karnataka, Orissa, Rajasthan, Maharashtra, Tamil Nadu, Telangana, Tripura, Uttar Pradesh", "Contact": "https://www.akshayapatra.org/onlinedonations\n  https://www.akshayapatra.org/", "Email": "infodesk@akshayapatra.org"},
{"Name": "PayTM Foundation", "Description": "Paytm’s not-for-profit entity Paytm Foundation is raising INR 10 Cr to donate oxygen concentrators across India amidst the worsening Covid-19 situation in the country. Paytm will match the contributions received through this initiative. ", "State": "PAN India", "Contact": "https://paytm.com/offer/donate-oxygen?utm_source=social_media&utm_medium=Twitter&utm_campaign=oxygen\n  https://paytm.com/offer/donate-oxygen-faqs", "Email": null},
{"Name": "Zomato Feeding India", "Description": "Zomato's not-for-profit arm Feeding India has partnered with logistics firm Delhivery to source oxygen concentrators and related supplies to help hospitals and families in need. ", "State": "PAN India", "Contact": "https://pages.razorpay.com/zfi-oxygen\n  https://www.feedingindia.org/", "Email": null}
][
{"Name": "Mission Oxygen", "Description": "Mission Oxygen began as a overnight initiative by a community of founders and entrepreneurs across Delhi/NCR to aid and assist hospitals that were running out of oxygen to treat Covid19 patients. Different members across this community segregated tasks according to their core competencies across crowdfunding, supply procurement, logistics, distribution/demand estimation, amplification and PR with the aim of purchasing, importing and delivering life saving concentrators to hospitals and nursing homes across the city.", "State": "Delhi NCR", "Contact": "https://www.ketto.org/fundraiser/mission-oxygen-helping-hospitals-to-save-lives\n  https://www.missionoxygen.org/", "Email": []},
{"Name": "Gautam Gambhir Foundation", "Description": "The Gautam Gambhir Foundation is extending their support to the marginalized, by assuring that their health care workers stand at the first line of defense.", "State": "Delhi NCR", "Contact": "https://gautamgambhirfoundation.org/donate/\n  https://gautamgambhirfoundation.org", "Email": ["info@gautamgambhirfoundation.org"]},
{"Name": "Mazdoor Kitchen ", "Description": "Mazdoor Kitchen is a citizen run voluntary initiative, working to provide meals and subsistence to daily wage workers in North Delhi. Run by a dedicated team of volunteers comprising professors, students, artists and people from the community itself, it has been providing meals and ration kits to hundreds of people across North Delhi. ", "State": "Delhi (North)", "Contact": "https://www.ketto.org/fundraiser/mazdoorkitchen\n  https://www.instagram.com/mazdoorkitchen/", "Email": []},
{"Name": "Breathe India", "Description": "A group of IIT alumni, in coordination with SaveLife foundation have started a fund collection drive for oxygen .concentrators to be setup in and around Delhi NCR region.", "State": "Delhi NCR", "Contact": "https://milaap.org/fundraisers/support-arrange-oxygen-concentrators-in-delhi\n  https://milaap.org/fundraisers/support-arrange-oxygen-concentrators-in-delhihttps://milaap.org/fundraisers/support-arrange-oxygen-concentrators-in-delhi", "Email": ["ashu95.ranka@gmail.com"]},
{"Name": "Chikka Foundation", "Description": "Chikka Federation is a United Nations accredited NGO that is carrying out Covid-19 relief work through distribution of ration, masks and soaps amongst the resourceless commmunities of Muzaffarpur and providing meals to some daily wage workers and domestic help who have been rendered jobless in the current situation. The NGO is also carrying out awareness campaigns about the importance of maintaining social distance.", "State": "Delhi, Bihar", "Contact": "http://www.chikkafederation.org/", "Email": [": Santosh Kumar ", ": 9570716800"]},
{"Name": "Access Foundation", "Description": "Access Foundation a  registered NGO u/s 12AA and 80G of Income tax act, has been working since the beginning of Pandemic  to provide free ambulance services with the fleet of 6 ambulances we presently have . More than 350 patients have benefitted using our free cylinders and concentrators services. Access is also a part of 2 isolation centres at Golconda and Malakpet which will be run free of cost. Ration has been distributed to about 3500  afflicted families during the past one year . Also Access Foundation plays a vital role in the HUM helpline where about 4000 patients have obtained free online consultations by experts. Livelihood projects have been in full swing to help the people re establish themselves. \n\t\t\tAmbulance helpline (free for Govt hospitals , isolation centres, vaccine centres ) : 9908820066 \n\t\t\tHUM helpline for free consultations : 7306600600", "State": "Hyderabad", "Contact": " https://accessfoundation.in/donation", "Email": []},
{"Name": "Enrich Lives Foundation", "Description": "Enrich Lives Foundation (formerly Annapurna Movement) is a non-profit organization focused on hunger alleviation, education, women empowerment, poverty alleviation and public health. Founded during the COVID-19 2020 lockdown in India by individuals with past involvement in social causes as Annapurna Movement, the organization was involved in the distribution of food grains and meals to the people worst affected. Enrich Lives Foundation is now involved in a variety of causes affecting the most underprivileged sections of the society:  1) Meal distribution 2) Grocery kit distribution 3) Job placements", "State": "Mumbai", "Contact": "https://www.ketto.org/fundraiser/supporting-the-needy-through-COVID-19-crisis\n  https://www.annapurnamovement.com/home", "Email": ["team@enrichlivesfoundation.org"]},
{"Name": "Khaana Chahiye", "Description": "Khaana Chahiye Foundation started as a citizen-led campaign in March 2020 to meet the immediate, lockdown-induced food demands of the homeless, migrant workers, daily wage laborers, and other vulnerable populations in the city of Mumbai", "State": "Mumbai", "Contact": "https://fundraisers.giveindia.org/fundraisers/khaanachahiye-mumbai-is-battling-hunger-along-with-covid-19-again\n  https://www.khaanachahiye.com", "Email": ["contact@khaanachahiye.com"]},
{"Name": "Swasth", "Description": "Founded in 2009, Swasth Foundation is a non-profit social enterprise committed to health and joy for all. They focus on improving the well-being of the poor by providing a range of affordable and high-quality primary-preventive health services.", "State": "Mumbai", "Contact": "https://www.swasth.org/donate.html\n  https://www.swasth.org/index.html", "Email": ["info@swasth.org"]},
{"Name": "United Way Mumbai", "Description": "United Way Mumbai is a premier non-profit organization with a mission to improve lives by mobilizing the caring power of communities to advance the common good. As a leader in the Indian development sector, UWM works closely with a network of 400+ NGOs and a large number of corporates for their CSR programmes, workplace giving campaigns and other events. This includes designing of CSR policy and strategies, due diligence of NGO partners, programme implementation, employee volunteering, impact assessments and ­financial and programmatic reporting.", "State": "Mumbai", "Contact": "https://www.unitedwaymumbai.org/donation.htm\n  https://www.unitedwaymumbai.org/", "Email": ["contact@unitedwaymumbai.org"]},
{"Name": "Spoorthi Foundation- Coronavarus Relief Fund", "Description": "Sphoorti creates a safe and secure haven for our children to learn, improve, and bloom into who they really are so they can grow up to afford themselves the dignity and strength they need to break free of the cycle. As an organization, we work to erase the barriers between the kids and their potential. This campaign can help provide basic nutrition and vitamin and mineral tablets, dry fruits along with sanitary products like masks, gloves and sanitizers.", "State": "Telangana", "Contact": "https://pages.razorpay.com/pl_EcmuS3Uv5CxrfX/view\n  https://www.sphoorti.org", "Email": ["srivyal@sphoorti.org"]},
{"Name": "Hemkunt Foundation", "Description": "Gurugram based NGO working on 12+ projects from last 12 years for upliftment of underprivileged section of society. They are currently distributing Oxygen Cylinders to COVID-19 patients for free.", "State": "Delhi NCR/Haryana", "Contact": " https://www.donatekart.com/Hemkunt-Foundation/Give-Oxygen-Cylinders?utm_source=facebook&utm_medium=cpc&utm_campaign=2834_hemkunt\n  https://hemkuntfoundation.com/contact/", "Email": ["hemkuntfoundation13@gmail.com"]},
{"Name": "Sakina Foundation", "Description": "‘Sakina’ – Peace for one and all – Sakina Foundation strives for this very humane yearning. Since last year they are involved in covid relief measures majorly in Telangana and different parts of India. They are accepting donation in the form of oxygen cylinders, Remdesivir injections, covid medicines, masks, sanitizers, gloves, PPE, grocery. ", "State": "Telangana, AP", "Contact": "http://sakinafoundation.org/", "Email": ["9885178688"]},
{"Name": "ACT Grants", "Description": "ACT grant is backing India’s best social entrepreneurs to combat COVID-19 using inventive start-up thinking. they are using their resources to find solutions to the acute shortage of oxygen by setting up oxygen concentrators at hospitals and nursing homes.", "State": "Mumbai, Bengaluru", "Contact": "https://actgrants.in/donate/\n  https://actgrants.in/", "Email": ["core-pm@actgrants.in"]},
{"Name": "Feeding from Far", "Description": "Feeding From Far is an initiative that has been feeding the poor and unemployed who are struggling to feed themselves during the lockdown. They have managed to distributed over 10 lakh meals to the needy since the first lockdown hit through cooked meals and ration kits.", "State": "Mumbai, Govandi", "Contact": "https://www.ketto.org/fundraiser/FeedingfromfarForCorona\n  https://www.facebook.com/feedingfromfar/", "Email": ["feedingfromfar@gmail.com"]},
{"Name": "Tarai Environment Awareness Samiti (TEAS)", "Description": "Farmers, Villagers, Community etc. for their development, livelihood, health and education. TEAS along with the Government Organization, delivering various activities helping Government in implementing the Government policies to the grass root level.", "State": "Uttar Pradesh, Maharashtra", "Contact": "https://teasngo.org/", "Email": ["ngoteasblp@gmail.com", "Google Pay and UPI: 9415036118"]},
{"Name": "Khalsa Aid", "Description": "Khalsa Aid international is providing free oxygen concentrators to COVID patients. ", "State": "Delhi, Punjab, Chandigarh", "Contact": "https://www.khalsaaid.org/donate-india\n  https://www.khalsaaid.org/", "Email": ["foodbank@khalsaaid.org"]},
{"Name": "MCKS Food", "Description": "MCKS Food for the Hungry Foundation Delhi, is a not for profit organization started in 2005. Infused with Master Choa Kok Sui's teachings, the foundation looks to be the force bringing about the change in and around us. They affect the lives of people in a tangible way; reaching out with food to the hungry and empowering them with skills to move from despair to hope.", "State": "Delhi, Jharkhand, Orissa", "Contact": "https://mcksfood.com/donate\n  https://mcksfood.com/", "Email": ["info@mcksfood.com"]},
{"Name": "Making the Difference", "Description": "Making the Difference (MTD) is working to improve the quality of life for disadvantaged individuals through nutrition, health care, education. They are providing medical equipments all over Mumbai, masks and kits PPE in Varanasi, tiffin service to home quarantine patient in Mira bhayander, ration distribution for local communities all over Mumbai. ", "State": "Mumbai, Varanasi & Mira Bhayander", "Contact": "https://pages.razorpay.com/pl_H1F8zUWh1CWF8p/view\n  https://makingthedifference.in/", "Email": ["help@mtdngo.org"]},
{"Name": "Khushiyaan Foundation", "Description": "Khushiyaan Foundation is extending its on-ground support by feeding people through their \"Roti-Ghar\" initiative.", "State": "Delhi, Bengaluru, Hyderabad, Orissa", "Contact": "https://donate.khushiyaanfoundation.org/donate\n  https://www.khushiyaanfoundation.org/", "Email": ["support@khushiyaanfoundation.org"]},
{"Name": "Give India", "Description": "Established in 2000, Give India is one of the most trusted crowdfunding websites in India. They have launched ICRF-2 to support gaps in healthcare and other critical needs.  ", "State": "Delhi, Bengaluru, Mumbai, Patna", "Contact": "https://covid.giveindia.org/\n  https://covid.giveindia.org/", "Email": ["ruchi@giveindia.org"]},
{"Name": "Help Now - Ambulance Services", "Description": "HelpNow was started by 3 IITians Aditya Makkar, Shikar Agarwal and Venkatesh Amrutwar and has built the largest network of private ambulance.  HelpNow is an Initiative by young students providing a safe, 24x7 logistics network for transporting COVID patients/suspects, Drugs, Phlebotomists, Healthcare workers (docs, nurses) and Blood/Organs/Medical supplies in India.                                                                           You can help by donating funds for :  1) Purchasing BLS Oxygen Ambulances. 2) 50,000+ PPE Kits. The staff of 300 ambulances (drivers and paramedics), require a minimum of 5 kits a day, per person. 3) Extending free ambulance support to the poor. 4) Incentivizing an army of drivers to join the cause and reinvigorate ambulance supply.", "State": "Mumbai, Delhi, Bengaluru, Pune", "Contact": "https://www.ketto.org/fundraiser/getHelpNow\n  https://www.gethelpnow.in/#/", "Email": []},
{"Name": "Concern India", "Description": "Concern India Foundation was set up in 1991 as a registered non-profit, public charitable trust to extend financial and non-financial support to grassroots level NGOs working in the areas of education, health and community development.", "State": "Mumbai, New Delhi, Bengaluru, Chennai, Kolkata, Hyderabad", "Contact": "https://www.concernindiafoundation.org/donate/\n  https://www.concernindiafoundation.org/", "Email": ["bangalore@concernindia.org // gaver.chatterjee@concernindia.org"]},
{"Name": "KVN Foundation", "Description": "KVN Foundation is supplying free oxygen concentrators to the needy so that they can get critical life support till they find a hospital bed, get access to doctors, or recover completely. These will be provided for 5 to 10 days’ duration as needed, will then be taken back, sanitized, reused on next patient with fresh set of consumables.", "State": "Bangalore, Chennai, Hyderabad, Mumbai, and Noida.", "Contact": "https://fundraisers.giveindia.org/nonprofits/kvn-foundation\n  https://kvnfoundation.com/", "Email": []},
{"Name": "Milaap", "Description": "Milaap is one of India's most used crowdfunding platform. Multiple non-profits are raising funds on this platform for various relief causes related to COVID 19.", "State": "Delhi NCR, Hyderabad, Chennai, Bihar, Bengaluru", "Contact": "https://milaap.org/fundraisers/support-covid-19-delhi-2021-affected-people\n  https://milaap.org/fundraisers/donate-to-coronavirus-relief-fund \n  https://milaap.org/fundraisers/support-india \n  https://milaap.org/fundraisers/support-hlfppt-1\n  https://milaap.org/fundraisers/support-mercy-mission\n  https://milaap.org/fundraisers/support-grameenfoundation\n  https://milaap.org/", "Email": ["feedback@milaap.org"]},
{"Name": "Uttishtha Foundation", "Description": "Uttishtha Foundation is working on the following initiatives: 1) Family Survival Kits which include basic ration . Along with Corona protective gear like masks, bathing and washing soaps, for disadvantaged elders and their family of 5. 2) Protective Hygiene Kits for our elders, to fight COVID-19 which include Sanitizers, Mask, Tissues, Hand wash etc. 3) Free Meals to the homeless in night shelters, on roads, elders in old age homes, slums and migrant daily wage labors who have nowhere and no one to turn to.  \n\t\t\tWe were able to help more than 60 families across the nation.   Currently, they are looking for donations to procure Oxygen Concentrators and install them at rural clinics that are in dire need of Oxygen and other basic healthcare amenities.", "State": "Sitapur, Delhi NCR, Lucknow, Villages across UP", "Contact": "https://uttishthafoundation.com/donations/covid-19-help/\n  https://uttishthafoundation.com/about-us/", "Email": ["uttishthafoundation@gmail.com", ", ", "or ", " ufdonation@ybl ", "Union Bank of India ", "384101010036401 ", " UBIN0538418 "]},
{"Name": "Goonj Rahat COVID", "Description": "Goonj aims to build an equitable relationship of strength, sustenance and dignity between the cities and villages using the under-utilized urban material as a tool to trigger development with dignity, across the country.", "State": "Bengaluru, Chennai, Delhi, Hyderabad, Kochi, Kolkata, Mumbai, Rishikesh", "Contact": "https://goonj.org/donate/\n  https://goonj.org/support-covid-19-affected/", "Email": []},
{"Name": "Pint Network", "Description": "PINT - Plasma In Need for Transfusion , a non-profit organization and online platform helping COVID-19 patients in need of convalescent plasma find and match with donors, quicker and more efficiently.", "State": "Mumbai, Delhi, TN, Gujarat, UP, WB, Rajasthan, Karnataka, Andhra Pradesh, Haryana, MP", "Contact": "https://www.ketto.org/fundraiser/help-as-many-COVID-19-patients-in-need\n  https://pintnetwork.com/home", "Email": ["admin@pintnetwork.com  "]},
{"Name": "Uday Foundation", "Description": "The Uday Foundation is a non-profit organization based in New Delhi, India.  disaster relief. It is starting a campaign #StayWell to make and distribute at least 10,000 Wellness Kits – comprising some basic over the counter medicines, a tetra-pack of healthy drink such as ORS, oximeter, etc.", "State": "Delhi NCR, Jammu and Kashmir, Uttarakhand, Uttar Pradesh, Andhra Pradesh and Orissa", "Contact": "https://www.udayfoundation.org/donatefood/\n  https://www.udayfoundation.org/", "Email": ["info@udayfoundation.org"]},
{"Name": "Plan India", "Description": "Plan India has reached out to 200,000+ families with dry ration and hygiene kits, meeting the urgent needs of 1 million+ people on the ground in 12 states. To ensure learning does not stop for girls’ during the pandemic, Plan India is distributing 35000+ education kits. Each kit contains textbooks and reference books as per the girls’ grade, notebooks, pen and pencil.", "State": "Siddharth Nagar (Uttar Pradesh), Haridwar (Uttarakhand), Hazaribagh, West Singhbhum, and Khunti (Jharkhand), Karauli (Rajasthan), and Muzaffarpur (Bihar).", "Contact": "https://www.planindia.org/get-involved/make-a-donation/covid-19-crisis/", "Email": ["planindia@planindia.org"]},
{"Name": "SEEDS (Sustainable Environment and Ecological Development Society)", "Description": "SEEDS is a leading humanitarian organization recently awarded with the most prestigious annual Subhash Chandra Bose Aapda Prabandhan Puraskar 2021 by the Government of India for its invaluable contribution and selfless service rendered in the field of Disaster Management. It is currently working towards the continuing challenge of Covid-19. Sharing the increased burden on our health care system, SEEDS is supporting through:", "State": "Delhi, Haryana, Uttarakhand, Bihar, West Bengal, Kerala, Karnataka, Maharashtra, Telangana, Punjab, Uttar Pradesh", "Contact": "https://www.seedsindia.org/donation/?donation_for=covid19\n  https://www.seedsindia.org/banktransfers/\n  https://www.seedsindia.org/covid19/", "Email": ["Sidarth Sharma", "ssharma@seedsindia.org"]},
{"Name": "Akshaya patra Foundation", "Description": "The Akshaya Patra Foundation is an NGO in India headquartered in Bengaluru. Our organization strives to eliminate classroom hunger by implementing the Mid-Day Meal Scheme in the government schools and government-aided schools. Alongside, Akshaya Patra also aims at countering malnutrition and supporting the right to education of socio-economically disadvantaged children. Since 2000, Akshaya Patra has been concerting all its efforts towards providing fresh and nutritious meals to children on every single school day. We are continuously leveraging technology to multiply our reach. The state-of-the-art kitchens have become a subject of study and have attracted curious visitors from around the world. Partnership with the Government of India and various State Governments, along with the persistent support from corporates, individual donors, and well-wishers have helped them to grow from serving just 1,500 children in 5 schools in 2000 to serving 1.8 million children. Today, Akshaya Patra is the world’s largest (not-for-profit run) Mid-Day Meal Programme serving wholesome food every school day to over 1.8 million children from 19,039 schools across 12 states & 2 Union territories of India.", "State": "Andhra Pradesh, Assam, Chhattisgarh, Delhi, Gujarat, Karnataka, Orissa, Rajasthan, Maharashtra, Tamil Nadu, Telangana, Tripura, Uttar Pradesh", "Contact": "https://www.akshayapatra.org/onlinedonations\n  https://www.akshayapatra.org/", "Email": ["infodesk@akshayapatra.org"]},
{"Name": "PayTM Foundation", "Description": "Paytm’s not-for-profit entity Paytm Foundation is raising INR 10 Cr to donate oxygen concentrators across India amidst the worsening Covid-19 situation in the country. Paytm will match the contributions received through this initiative. ", "State": "PAN India", "Contact": "https://paytm.com/offer/donate-oxygen?utm_source=social_media&utm_medium=Twitter&utm_campaign=oxygen\n  https://paytm.com/offer/donate-oxygen-faqs", "Email": []},
{"Name": "Zomato Feeding India", "Description": "Zomato's not-for-profit arm Feeding India has partnered with logistics firm Delhivery to source oxygen concentrators and related supplies to help hospitals and families in need. ", "State": "PAN India", "Contact": "https://pages.razorpay.com/zfi-oxygen\n  https://www.feedingindia.org/", "Email": []}
]